In [18]:
import pandas as pd
df=pd.read_table('http://bit.ly/movieusers')
df.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [19]:
df=pd.read_table('http://bit.ly/movieusers',sep='|')
df.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [20]:
user_cols=['user_id','age','gender','occupation','zip_code']# use our customized columns
df=pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=user_cols,index_col='user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [21]:
df.shape

(943, 4)

In [22]:
df.zip_code.duplicated().sum() # counts of duplicated zip_code values

148

In [23]:
df.duplicated().sum() # we have 7 rows are duplicated

7

In [24]:
df.loc[df.duplicated(),:]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [25]:
df.loc[df.duplicated(keep='first'),:]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [26]:
df.loc[df.duplicated(keep='last'),:]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [27]:
# keep=False will show us all the duplicates
df.loc[df.duplicated(keep=False),:]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [28]:
df.drop_duplicates(keep='last').shape

(936, 4)

In [29]:
df.drop_duplicates(keep='first').shape

(936, 4)

In [30]:
df.drop_duplicates(keep=False).shape

(929, 4)

In [32]:
# we just find the duplicates in two columns
df.duplicated(subset=['age','zip_code']).sum()

16

In [33]:
df.drop_duplicates(subset=['age','zip_code']).shape

(927, 4)